# project
"""Исполнитель Нолик преобразует число на экране. 
У исполнителя есть три команды, которым присвоены номера:
1. Прибавить 2
2. Прибавить 5
3. Умножить на 2
Сколько существует программ, состоящих из 11 команд,
 для которых при исходном числе 5 результатом является число 41?"""
def f(curr, end, c):
    if curr == end: return c==11
    if curr>end: return 0
    if curr<end:
        return f(curr+2, end, c+1) + f(curr+5, end, c+1) + f(curr*2, end, c+1)
print(f(5, 41, 0))
